src/toir_cf/src/ExchangePlans/торо_ИнтеграцияСАИСДиспетчер/торо_ИнтеграцияСАИСДиспетчер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="f26a5578-67dd-4a49-827b-c501c89f546e">
  <name>торо_ИнтеграцияСАИСДиспетчер</name>
  <attributes>
    <name>ИспользованиеРегламентногоЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПоУмолчанию</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПускаПоУмолчанию</name>
    <type>
      <types>CatalogRef.торо_ВидыПусковОР</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияВыявленияДефектаПоУмолчанию</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОбъектыРемонта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВыявленныеДефекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьСостоянияОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьКонтролируемыеПоказателиОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьНаработкуОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтсчетаДляЗагрузкиДокументов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыКомплектующее</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатурыРасходныйМатериал</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьЦеныНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныДляНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияПериодаЗагрузкиДанных</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьИнициатораВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

src/toir_cf/src/ExchangePlans/торо_ИнтеграцияСАИСДиспетчер/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	ЗагружатьВыявленныеДефекты = ?(ПолучитьФункциональнуюОпцию("торо_УчетВыявленныхДефектовОборудования"), ЗагружатьВыявленныеДефекты, Ложь);
	ЗагружатьКонтролируемыеПоказателиОР = ?(ПолучитьФункциональнуюОпцию("торо_УчетКонтролируемыхПоказателей"), ЗагружатьКонтролируемыеПоказателиОР, Ложь);
	ЗагружатьНаработкуОР = ?(ПолучитьФункциональнуюОпцию("торо_УчетНаработкиОборудования"), ЗагружатьНаработкуОР, Ложь);
	ЗагружатьСостоянияОР = ?(ПолучитьФункциональнуюОпцию("торо_УчетСостоянияОборудования"), ЗагружатьСостоянияОР, Ложь);
КонецПроцедуры

#КонецОбласти
